---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHeadPosition
source: html/883ccdc6-9d4e-7844-9f81-e77124f39677.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHeadPosition Property

The position for the tag's head.

## Syntax (C#)
```csharp
public XYZ TagHeadPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null